from tkinter import *

window = Tk()

window.title('message demo')

window.geometry('1440x900')

msg1 = Message(window, text='这是一条消息', width=200)
msg1.pack()

msg2 = Message(window, text='这是一条超长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长'
                            '长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的消息')
#            , width=20000
msg2.pack()
window.mainloop()
